EdleK1/X1-Thorn/1_Code/3_STM32/0_workspace/X1_Thorn_v3/Core/Src/User/Test/TestESP32/TestESP32.c
/**
  ******************************************************************************
  * @file           : Test.c
  * @brief          : ESP32 communications test
  ******************************************************************************
*/


#include "../../Core/Src/User/Peripheral/LCD/lcd.h"
#include "tim.h"
#include "../../Core/Src/User/Peripheral/ESP32/ESP32.h"

static uint8_t active;
esp32_commands_t curr_esp32_commands_test;
static uint8_t text[50];


void ESP32_Test_Init(void)
{
	ESP32_Init();

	ST7735_LCD_Driver.FillRect(&st7735_pObj, 0, 0, ST7735Ctx.Width,ST7735Ctx.Height, BLACK);
}


void ESP32_Test_Loop(void)
{
  ESP32_Get_Commands(&curr_esp32_commands_test);
  ESP32_Send_ESC_Status();

  sprintf((char *)&text, "ax=%.2f p=%.2f                  ",curr_esp32_commands_test.thrust_command,curr_esp32_commands_test.p_command);
  LCD_ShowString(4, 22, ST7735Ctx.Width, 16, 16, text);

  sprintf((char *)&text, "roll=%.2f pitch=%.2f            ",curr_esp32_commands_test.yaw_command,curr_esp32_commands_test.pitch_command);
  LCD_ShowString(4, 40, ST7735Ctx.Width, 16, 16, text);

  sprintf((char *)&text, "active=%u            ",active);
  LCD_ShowString(4, 58, ST7735Ctx.Width, 16, 16, text);
}
